<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Untitled Document</title>
</head>

<body>
<p>Το embed κειμενο ειναι απευθειας κωδικας html (η γλωσσα σχεδιασμου  ιστοσελιδων)</p>
<p>Με το embed κειμενο ειναι δυνατον να μπορουμε να τοποθετουμε στην σελιδα μας ζωντανο περιεχομενο οπως: Συνδεσμους, Εικονες, Μουσικη, Βιντεο, Παιχνιδια οπου μπορουμε να βρουμε απο αλλες ιστοσελιδες</p>
<p>Μερικες ιστοσελιδες οπως το Youtube υποστηριζουν την τεχνολογια της ενσωματωσης. Π.χ. αν βλεπουμε ενα βιντεο στο youtube και θελουμε να το μεταφερουμε στη σελιδα μας μπορουμε να πατησουμε κατω απο το βιντεο ενσωματωση και θα μας δωσει ενα κειμενο. Αν το εισαγουμε στη σελιδα ως embed κειμενο, το βιντεο θα εμφανιζεται πανω στη σελιδα.</p>
<p>Για θεματα ασφαλειας της σελιδας η ετικετες &lt;script&gt; &lt;style&gt; &lt;iframe&gt; εχουν απενεργοποιηθει. Επισης το στοιχειο οπου εισαγεται θα πρεπει να ειναι μεχρι 680 pixel πλατος και 500 pixel υψος για να μην εμφανιστουν μπαρες κυλησης (scroll bars).</p>
</body>
</html>